Revit 2024 API
WorksetDefaultVisibilitySettings.SetWorksetVisibility Method
 Set the default visibility of a workset.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2012
Syntax
C#
public void SetWorksetVisibility(
	WorksetId worksetId,
	bool visible
)
Visual Basic
Public Sub SetWorksetVisibility ( _
	worksetId As WorksetId, _
	visible As Boolean _
)
Visual C++
public:
void SetWorksetVisibility(
	WorksetId^ worksetId,
	bool visible
)
Parameters
worksetId
Type: Autodesk.Revit.DB.WorksetId
 Id of the workset.
visible
Type: System.Boolean
 Whether the workset should be visible by default or not.
Examples
CopyC#
public void HideWorkset(Document doc, View view, WorksetId worksetId)
{
    // get the current visibility
    WorksetVisibility visibility = view.GetWorksetVisibility(worksetId);
    // and set it to 'Hidden' if it is not hidden yet
    if (visibility != WorksetVisibility.Hidden)
    {
        view.SetWorksetVisibility(worksetId, WorksetVisibility.Hidden);
    }
    // Get the workset’s default visibility
    WorksetDefaultVisibilitySettings defaultVisibility = WorksetDefaultVisibilitySettings.GetWorksetDefaultVisibilitySettings(doc);
    // and making sure it is set to 'false'
    if (defaultVisibility.IsWorksetVisible(worksetId))
    {
        defaultVisibility.SetWorksetVisibility(worksetId, false);
    }
}
CopyVB.NET
Public Sub HideWorkset(doc As Document, view As View, worksetId As WorksetId)
    ' get the current visibility
    Dim visibility As WorksetVisibility = view.GetWorksetVisibility(worksetId)
    ' and set it to 'Hidden' if it is not hidden yet
    If visibility <> WorksetVisibility.Hidden Then
        view.SetWorksetVisibility(worksetId, WorksetVisibility.Hidden)
    End If
    ' Get the workset’s default visibility
    Dim defaultVisibility As WorksetDefaultVisibilitySettings = WorksetDefaultVisibilitySettings.GetWorksetDefaultVisibilitySettings(doc)
    ' and making sure it is set to 'false'
    If defaultVisibility.IsWorksetVisible(worksetId) Then
        defaultVisibility.SetWorksetVisibility(worksetId, False)
    End If
End Sub
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  There is no workset with this Id in the document.
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
Autodesk.Revit.Exceptions.InvalidOperationException |  WorksetDefaultVisibilitySettings is not applicable to family documents.
See Also
WorksetDefaultVisibilitySettings Class
Autodesk.Revit.DB Namespace